{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Input_1"}, "name": "Input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv2D_32", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_32", "inbound_nodes": [[["Input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_31", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_31", "inbound_nodes": [[["Conv2D_32", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_31", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "MaxPooling2D_31", "inbound_nodes": [[["Conv2D_31", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Dropout_16", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "Dropout_16", "inbound_nodes": [[["MaxPooling2D_31", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten_16", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten_16", "inbound_nodes": [[["Dropout_16", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense_18", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense_18", "inbound_nodes": [[["Flatten_16", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Dropout_17", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "Dropout_17", "inbound_nodes": [[["Dense_18", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense_17", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense_17", "inbound_nodes": [[["Dropout_17", 0, 0, {}]]]}], "input_layers": [["Input_1", 0, 0]], "output_layers": [["Dense_17", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0005000000237487257, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Conv2D_31/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Conv2D_31/bias", "shape": [32], "dtype": "float32"}, {"name": "Conv2D_32/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "Conv2D_32/bias", "shape": [32], "dtype": "float32"}, {"name": "Dense_17/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "Dense_17/bias", "shape": [10], "dtype": "float32"}, {"name": "Dense_18/kernel", "shape": [4608, 128], "dtype": "float32"}, {"name": "Dense_18/bias", "shape": [128], "dtype": "float32"}]}]}